simplementeUnPorito/Tesis-firmware-esp32/Nodo comunicación/slave/src/main.cpp
#ifndef STORE_PAGE_BATCHES
#define STORE_PAGE_BATCHES 32u
#endif
#define STORE_MAX_PAGES \
    ((PSOC_CAPTURE_MAX_BATCHES + STORE_PAGE_BATCHES - 1u) / STORE_PAGE_BATCHES)

static SampleBytes *g_store_pages[STORE_MAX_PAGES] = { nullptr };
static uint8_t      g_store_page_count = 0;
static uint16_t     g_store_capacity_batches = 0;
static uint32_t    *g_store_ts_us = nullptr;      /* timestamp relativo por batch */

/* ── Capturas store-then-dump: VER y START normal ────────────────────────── */
static volatile uint16_t g_view_remaining    = 0; /* legado live deshabilitado */
static volatile bool     g_view_store_active = false;
static volatile bool     g_start_store_active = false;
static volatile uint8_t  g_psoc_last_setn_value = 0;
static volatile uint32_t g_psoc_last_setn_ms = 0;
static volatile uint32_t g_psoc_setn_seq = 0;

#define PSOC_CFG_ACK_TIMEOUT_MS 750u
#define PSOC_SETN_ACK_TIMEOUT_MS 500u
#define PSOC_CAL_ACK_TIMEOUT_MS 450000u
#define PSOC_ADC_SNAPSHOT_ACK_TIMEOUT_MS 5000u
#define PSOC_CAL_PROGRESS_ACK_PERIOD_MS 3000u /* "sigue calibrando" (ok=2) hacia el maestro */
#define PSOC_CFG_READY_STALE_MS 5000u
#define COMPLETION_ACK_RETRY_PERIOD_MS 250u
#define COMPLETION_ACK_RETRY_COUNT 24u
#ifndef PSOC_START_FALLBACK_EXTRA_MS
  #ifdef PSOC_VIEW_START_FALLBACK_EXTRA_MS
    #define PSOC_START_FALLBACK_EXTRA_MS PSOC_VIEW_START_FALLBACK_EXTRA_MS
  #else
    #define PSOC_START_FALLBACK_EXTRA_MS 2500u
  #endif
#endif

static uint32_t g_sampling_start_ms = 0;
static uint32_t g_sampling_start_psoc_bytes = 0;
static uint32_t g_sampling_start_batches_ok = 0;
static bool     g_start_fallback_sent = false;
static uint8_t  g_completion_ack_sub_cmd = 0;
static uint8_t  g_completion_ack_ok = 0;
static uint8_t  g_completion_ack_retries_left = 0;
static uint32_t g_completion_ack_next_ms = 0;

static volatile uint32_t g_psoc_rx_edges = 0;
static volatile uint8_t  g_psoc_rx_last_level = 0;

#ifndef PSOC_RX_SCAN_ENABLE
  #define PSOC_RX_SCAN_ENABLE 0
#endif

#if PSOC_RX_SCAN_ENABLE
struct GpioScanSlot {
    uint8_t pin;
    volatile uint32_t edges;
    volatile uint8_t level;
};

static GpioScanSlot g_rx_scan[] = {
    {4, 0, 0}, {5, 0, 0}, {12, 0, 0}, {13, 0, 0}, {14, 0, 0},
    {18, 0, 0}, {19, 0, 0}, {21, 0, 0}, {22, 0, 0},
    {25, 0, 0}, {27, 0, 0}, {32, 0, 0}, {33, 0, 0},
};

static void IRAM_ATTR onRxScan0()  { g_rx_scan[0].edges++;  g_rx_scan[0].level  = (uint8_t)digitalRead(g_rx_scan[0].pin); }
static void IRAM_ATTR onRxScan1()  { g_rx_scan[1].edges++;  g_rx_scan[1].level  = (uint8_t)digitalRead(g_rx_scan[1].pin); }
static void IRAM_ATTR onRxScan2()  { g_rx_scan[2].edges++;  g_rx_scan[2].level  = (uint8_t)digitalRead(g_rx_scan[2].pin); }
static void IRAM_ATTR onRxScan3()  { g_rx_scan[3].edges++;  g_rx_scan[3].level  = (uint8_t)digitalRead(g_rx_scan[3].pin); }
static void IRAM_ATTR onRxScan4()  { g_rx_scan[4].edges++;  g_rx_scan[4].level  = (uint8_t)digitalRead(g_rx_scan[4].pin); }
static void IRAM_ATTR onRxScan5()  { g_rx_scan[5].edges++;  g_rx_scan[5].level  = (uint8_t)digitalRead(g_rx_scan[5].pin); }
static void IRAM_ATTR onRxScan6()  { g_rx_scan[6].edges++;  g_rx_scan[6].level  = (uint8_t)digitalRead(g_rx_scan[6].pin); }
static void IRAM_ATTR onRxScan7()  { g_rx_scan[7].edges++;  g_rx_scan[7].level  = (uint8_t)digitalRead(g_rx_scan[7].pin); }
static void IRAM_ATTR onRxScan8()  { g_rx_scan[8].edges++;  g_rx_scan[8].level  = (uint8_t)digitalRead(g_rx_scan[8].pin); }
static void IRAM_ATTR onRxScan9()  { g_rx_scan[9].edges++;  g_rx_scan[9].level  = (uint8_t)digitalRead(g_rx_scan[9].pin); }
static void IRAM_ATTR onRxScan10() { g_rx_scan[10].edges++; g_rx_scan[10].level = (uint8_t)digitalRead(g_rx_scan[10].pin); }
static void IRAM_ATTR onRxScan11() { g_rx_scan[11].edges++; g_rx_scan[11].level = (uint8_t)digitalRead(g_rx_scan[11].pin); }
static void IRAM_ATTR onRxScan12() { g_rx_scan[12].edges++; g_rx_scan[12].level = (uint8_t)digitalRead(g_rx_scan[12].pin); }

static void (* const g_rx_scan_isr[])(void) = {
    onRxScan0, onRxScan1, onRxScan2, onRxScan3, onRxScan4,
    onRxScan5, onRxScan6, onRxScan7, onRxScan8, onRxScan9,
    onRxScan10, onRxScan11, onRxScan12,
};

static bool rxScanIsReservedPin(uint8_t pin)
{
    return pin == (uint8_t)PSOC_UART_RX ||
           pin == (uint8_t)PSOC_UART_TX ||
           pin == (uint8_t)SYNC_TO_PSOC_PIN ||
           pin == (uint8_t)SYNC_IN_PIN ||
           pin == (uint8_t)DEBUG_HW_START_PIN;
}

static void beginPsocRxScan()
{
    for (size_t i = 0; i < (sizeof(g_rx_scan) / sizeof(g_rx_scan[0])); i++) {
        const uint8_t pin = g_rx_scan[i].pin;
        if (rxScanIsReservedPin(pin)) {
            continue;
        }
        pinMode(pin, INPUT_PULLUP);
        g_rx_scan[i].level = (uint8_t)digitalRead(pin);
        attachInterrupt(digitalPinToInterrupt(pin), g_rx_scan_isr[i], CHANGE);
    }
    SLAVE_LOG_PRINTLN("[SLAVE] RX_SCAN enabled");
}

static void logPsocRxScan()
{
    uint32_t edges[sizeof(g_rx_scan) / sizeof(g_rx_scan[0])];
    uint8_t levels[sizeof(g_rx_scan) / sizeof(g_rx_scan[0])];

    noInterrupts();
    for (size_t i = 0; i < (sizeof(g_rx_scan) / sizeof(g_rx_scan[0])); i++) {
        edges[i] = g_rx_scan[i].edges;
        levels[i] = g_rx_scan[i].level;
    }
    interrupts();

    SLAVE_LOG_PRINTF(
        "[SLAVE] RX_SCAN p4=%lu/%u p5=%lu/%u p12=%lu/%u p13=%lu/%u p14=%lu/%u "
        "p18=%lu/%u p19=%lu/%u p21=%lu/%u p22=%lu/%u p25=%lu/%u p27=%lu/%u p32=%lu/%u p33=%lu/%u\n",
        (unsigned long)edges[0], (unsigned)levels[0],
        (unsigned long)edges[1], (unsigned)levels[1],
        (unsigned long)edges[2], (unsigned)levels[2],
        (unsigned long)edges[3], (unsigned)levels[3],
        (unsigned long)edges[4], (unsigned)levels[4],
        (unsigned long)edges[5], (unsigned)levels[5],
        (unsigned long)edges[6], (unsigned)levels[6],
        (unsigned long)edges[7], (unsigned)levels[7],
        (unsigned long)edges[8], (unsigned)levels[8],
        (unsigned long)edges[9], (unsigned)levels[9],
        (unsigned long)edges[10], (unsigned)levels[10],
        (unsigned long)edges[11], (unsigned)levels[11],
        (unsigned long)edges[12], (unsigned)levels[12]);
}
#endif

/* ── Objetos ─────────────────────────────────────────────────────────────── */
static PsocUART       psoc;
static EspNowTransport transport;

/* Helpers de pulsos GPIO de osciloscopio (módulo aparte). */
#include "scope_pulse.h"

static bool sameMac(const uint8_t a[6], const uint8_t b[6])
{
    return memcmp(a, b, 6) == 0;
}

static bool usableUnicastMac(const uint8_t mac[6])
{
    static const uint8_t zero[6] = {0, 0, 0, 0, 0, 0};
    static const uint8_t broadcast[6] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};
    return !sameMac(mac, zero) && !sameMac(mac, broadcast);
}

static bool masterMacIsDefaultBroadcast()
{
    return !usableUnicastMac(MASTER_MAC_DEFAULT);
}

