simplementeUnPorito/Tesis-firmware-esp32/Nodo comunicación/slave/src/main.cpp
static const char *psocCalStageName(uint8_t stage)
{
    if (g_psoc_hw_class == 1u) {
        switch (stage) {
            case 0:  return "HAMMER_PGA";
            case 1:  return "HAMMER_LP";
            default: return "UNKNOWN";
        }
    } else {
        switch (stage) {
            case 0:  return "GEO_PGA";
            case 1:  return "GEO_BP";
            case 2:  return "GEO_ADDER";
            case 3:  return "GEO_LP";
            default: return "UNKNOWN";
        }
    }
}

static uint32_t absCounts32(int32_t value)
{
    return (value < 0) ? (uint32_t)(-value) : (uint32_t)value;
}

static int32_t psocCalCompareCounts(int32_t raw)
{
    return (g_psoc_hw_class == 1u) ? (int32_t)absCounts32(raw) : raw;
}

static int32_t adcCountsToMv(int32_t counts)
{
    const int64_t scaled = (int64_t)counts * 1000LL;
    if (scaled >= 0) {
        return (int32_t)((scaled + 26214LL) / 52429LL);
    }
    return (int32_t)((scaled - 26214LL) / 52429LL);
}

static int16_t clampInt16(int32_t value)
{
    if (value > 32767L) return 32767;
    if (value < -32768L) return -32768;
    return (int16_t)value;
}

static void sendCfgAckS16(uint8_t hiBase, uint8_t loBase, uint8_t stage, int32_t value)
{
    const int16_t clipped = clampInt16(value);
    const uint16_t raw = (uint16_t)clipped;
    sendCfgAck((uint8_t)(hiBase + stage), (uint8_t)((raw >> 8) & 0xFFu));
    sendCfgAck((uint8_t)(loBase + stage), (uint8_t)(raw & 0xFFu));
}

static void onPsocDiag(const PsocDiagEvent &event)
{
    static uint8_t calStage = 0xFF;
    static uint8_t calDac = 0;
    static int16_t calMeas = 0;
    static bool calMeasHigh = false;
    static uint32_t calMeasRaw = 0;
    static int32_t calMeasRawSigned = 0;
    static uint8_t calMeasRawByte = 0;
    static uint32_t calTargetRaw = 0;
    static int32_t calTargetSigned = 0;
    static uint8_t calTargetRawByte = 0;
    static bool calTargetValid = false;
    static uint32_t calSweepRaw = 0;
    static uint8_t calSweepRawByte = 0;
    static uint32_t adcSnapshotRaw = 0;
    static uint8_t adcSnapshotRawByte = 0;
    static uint32_t calPiRaw = 0;
    static uint8_t calPiRawByte = 0;
    static uint8_t calPiRawEvent = 0;
    static uint16_t calPointIndex = 0;
    g_psocConnected = true;

    if (g_state == SAMPLING && event.event != PSOC_EVT_DUMP_DONE) {
        return;
    }

    if (event.event == PSOC_EVT_DUMP_DONE && (g_view_store_active || g_start_store_active) &&
        g_state == SAMPLING && g_store_fill < g_rec_n_batches) {
        const bool wasView = g_view_store_active;
        const uint8_t doneSubCmd = wasView ? CMD_VIEW : CMD_START;
        const char *doneName = wasView ? "VIEW" : "START";
        digitalWrite(SYNC_TO_PSOC_PIN, LOW);
        g_view_store_active = false;
        g_start_store_active = false;
        g_state = STOPPED;
        sendCfgAck(doneSubCmd, 0);
        SLAVE_LOG_PRINTF("[SLAVE] %s partial dump fill=%u/%u -> FAIL\n",
                         doneName, (unsigned)g_store_fill, (unsigned)g_rec_n_batches);
        LOGM("CAPTURE_PARTIAL", "mode=%s,fill=%u,n=%u,bOK=%lu,bBad=%lu,drop=%lu,bytes=%lu",
             doneName,
             (unsigned)g_store_fill, (unsigned)g_rec_n_batches,
             (unsigned long)psoc.batchesOK(),
             (unsigned long)psoc.batchesBad(),
             (unsigned long)psoc.syncDrops(),
             (unsigned long)psoc.bytesRx());
    }

    if (event.event == PSOC_EVT_BOOT) {
        g_psoc_hw_class = event.value;
        SLAVE_LOG_PRINTF("[PSoC] boot hw=%u/%s pstate=%u/%s\n",
                         event.value, psocHwName(event.value),
                         event.psoc_state, psocStateName(event.psoc_state));
        LOGM("PSOC_BOOT", "hw=%u,hwName=%s,pstate=%u,pstateName=%s",
             event.value, psocHwName(event.value),
             event.psoc_state, psocStateName(event.psoc_state));
    }

    if (event.event == PSOC_EVT_SD_STATUS) {
        g_psoc_sd_status = event.value;
        g_psoc_sd_known = true;
        SLAVE_LOG_PRINTF("[PSoC] SD status=0x%02X present=%u type=%u selftest=%u\n",
                         event.value, (unsigned)(event.value & 1u),
                         (unsigned)((event.value >> 1) & 3u),
                         (unsigned)((event.value >> 3) & 1u));
        LOGM("PSOC_SD", "status=0x%02X,present=%u", event.value, (unsigned)(event.value & 1u));
    } else if (event.event == PSOC_EVT_SD_SESSION || event.event == PSOC_EVT_SD_ERROR) {
        SLAVE_LOG_PRINTF("[PSoC] %s val=0x%02X\n",
                         (event.event == PSOC_EVT_SD_SESSION) ? "SD_SESSION" : "SD_ERROR",
                         event.value);
        LOGM("PSOC_SD", "evt=0x%02X,val=0x%02X", event.event, event.value);
    }

    if (event.event == PSOC_EVT_SETN) {
        g_psoc_last_setn_value = event.value;
        g_psoc_last_setn_ms = millis();
        g_psoc_setn_seq++;
        SLAVE_LOG_PRINTF("[PSoC] SETN ack val=%u pstate=%u/%s\n",
                         event.value, event.psoc_state, psocStateName(event.psoc_state));
    } else if (event.event == PSOC_EVT_ARMED ||
               event.event == PSOC_EVT_SAMPLING_START ||
               event.event == PSOC_EVT_CHAIN_NEXT ||
               event.event == PSOC_EVT_CAPTURE_DONE ||
               event.event == PSOC_EVT_DUMP_START ||
               event.event == PSOC_EVT_DUMP_DONE ||
               event.event == PSOC_EVT_CAPTURE_WATCHDOG) {
        SLAVE_LOG_PRINTF("[PSoC] %s val=%u pstate=%u/%s fill=%u/%u\n",
                         psocDiagName(event.event), event.value,
                         event.psoc_state, psocStateName(event.psoc_state),
                         (unsigned)g_store_fill, (unsigned)g_rec_n_batches);
    }

    if (event.event == PSOC_EVT_CAL_START) {
        calStage = 0;
        calDac = 0;
        calMeas = 0;
        calMeasHigh = false;
        calMeasRaw = 0;
        calMeasRawSigned = 0;
        calMeasRawByte = 0;
        calTargetRaw = 0;
        calTargetSigned = 0;
        calTargetRawByte = 0;
        calTargetValid = false;
        adcSnapshotRaw = 0;
        adcSnapshotRawByte = 0;
        calPiRaw = 0;
        calPiRawByte = 0;
        calPiRawEvent = 0;
        calPointIndex = 0;
        g_cal_progress_ack_ms = millis();
        sendCfgAck(PSOC_CMD_CALIBRATE, 2);
        SLAVE_LOG_PRINTF("[CAL] start\n");
        LOGM("CAL_START", "pstate=%u", event.psoc_state);
    } else if (event.event == PSOC_EVT_CAL_DONE) {
        if (!(g_cfg_waiting && g_cfg_sub_cmd == PSOC_CMD_CALIBRATE)) {
            sendCfgAck(PSOC_CMD_CALIBRATE, event.value ? 1 : 0);
        }
        SLAVE_LOG_PRINTF("[CAL] done ok=%u\n", event.value);
        LOGM("CAL_DONE", "ok=%u,pstate=%u", event.value, event.psoc_state);
    } else if (event.event == PSOC_EVT_CAL_BUSY) {
        SLAVE_LOG_PRINTF("[CAL] busy\n");
        LOGM("CAL_BUSY", "pstate=%u", event.psoc_state);
    } else if (event.event == PSOC_EVT_CAL_STAGE_BEGIN) {
        calStage = event.value;
        calDac = 0;
        calMeas = 0;
        calMeasHigh = false;
        calMeasRaw = 0;
        calMeasRawSigned = 0;
        calMeasRawByte = 0;
        calTargetRaw = 0;
        calTargetSigned = 0;
        calTargetRawByte = 0;
        calTargetValid = false;
        adcSnapshotRaw = 0;
        adcSnapshotRawByte = 0;
        calPiRaw = 0;
        calPiRawByte = 0;
        calPiRawEvent = 0;
        calPointIndex = 0;
        g_cal_progress_ack_ms = millis();
        sendCfgAck(PSOC_CMD_CALIBRATE, (uint8_t)(3u + (event.value & 0x03u)));
        SLAVE_LOG_PRINTF("[CAL] begin stage=%u/%s\n",
                         event.value, psocCalStageName(event.value));
        LOGM("CAL_BEGIN", "stage=%u,name=%s", event.value,
             psocCalStageName(event.value));
    } else if (event.event == PSOC_EVT_SERVO_STAGE) {
        calStage = event.value;
        calDac = 0;
        calMeas = 0;
        calMeasHigh = false;
        calMeasRaw = 0;
        calMeasRawSigned = 0;
        calMeasRawByte = 0;
        calPointIndex = 0;
        SLAVE_LOG_PRINTF("[CAL] servo stage=%u/%s\n",
                         event.value, psocCalStageName(event.value));
        LOGM("SERVO_STAGE", "stage=%u,name=%s", event.value,
             psocCalStageName(event.value));
    } else if (event.event == PSOC_EVT_CAL_VERIFY_BEGIN) {
        calStage = event.value;
        calDac = 0;
        calMeas = 0;
        calMeasHigh = false;
        calMeasRaw = 0;
        calMeasRawSigned = 0;
        calMeasRawByte = 0;
        calPointIndex = 0;
        g_cal_progress_ack_ms = millis();
        sendCfgAck(PSOC_CMD_CALIBRATE, (uint8_t)(7u + (event.value & 0x03u)));
        SLAVE_LOG_PRINTF("[CAL] verify begin stage=%u/%s\n",
                         event.value, psocCalStageName(event.value));
        LOGM("CAL_VERIFY_BEGIN", "stage=%u,name=%s", event.value,
             psocCalStageName(event.value));
    } else if (event.event == PSOC_EVT_CAL_REALCHECK_BEGIN) {
        calStage = event.value;
        calDac = 0;
        calMeas = 0;
        calMeasHigh = false;
        calMeasRaw = 0;
        calMeasRawSigned = 0;
        calMeasRawByte = 0;
        calPointIndex = 0;
        g_cal_progress_ack_ms = millis();
        sendCfgAck(PSOC_CMD_CALIBRATE, (uint8_t)(11u + (event.value & 0x03u)));
        SLAVE_LOG_PRINTF("[CAL] realcheck begin stage=%u/%s\n",
                         event.value, psocCalStageName(event.value));
        LOGM("CAL_REALCHECK_BEGIN", "stage=%u,name=%s", event.value,
             psocCalStageName(event.value));
    } else if (event.event == PSOC_EVT_CAL_STAGE_DAC) {
        calDac = event.value;
    } else if (event.event == PSOC_EVT_CAL_SWEEP_DAC) {
        calDac = event.value;
        calSweepRaw = 0;
        calSweepRawByte = 0;
    } else if (event.event == PSOC_EVT_ADC_SNAPSHOT_BEGIN) {
        calStage = event.value;
        calDac = 0;
        calMeasRaw = 0;
        calMeasRawByte = 0;
        calTargetRaw = 0;
        calTargetRawByte = 0;
        calTargetValid = false;
        calSweepRaw = 0;
        calSweepRawByte = 0;
        adcSnapshotRaw = 0;
        adcSnapshotRawByte = 0;
        calPointIndex = 0;
        SLAVE_LOG_PRINTF("[ADC] snapshot begin stage=%u/%s\n",
                         calStage, psocCalStageName(calStage));
        LOGM("ADC_SNAPSHOT_BEGIN", "stage=%u,name=%s",
             calStage, psocCalStageName(calStage));
    } else if (event.event == PSOC_EVT_CAL_STAGE_TARGET32) {
        calTargetRaw = (calTargetRaw << 8) | event.value;
        calTargetRawByte++;
        if (calTargetRawByte >= 4) {
            calTargetRawByte = 0;
            calTargetSigned = (int32_t)calTargetRaw;
            calTargetRaw = 0;
            calTargetValid = true;
            SLAVE_LOG_PRINTF("[CAL] target stage=%u/%s counts=%ld mV=%ld\n",
                             calStage, psocCalStageName(calStage),
                             (long)calTargetSigned,
                             (long)adcCountsToMv(calTargetSigned));
            LOGM("CAL_TARGET", "stage=%u,name=%s,target=%ld,target_mV=%ld",
                 calStage, psocCalStageName(calStage),
                 (long)calTargetSigned, (long)adcCountsToMv(calTargetSigned));
        }
    } else if (event.event == PSOC_EVT_CAL_SWEEP_MEAS32) {
        calSweepRaw = (calSweepRaw << 8) | event.value;
        calSweepRawByte++;
        if (calSweepRawByte >= 4) {
            int32_t sweepSigned;
            uint32_t absRaw;
            int32_t cmpRaw;
            int32_t errRaw;
            calSweepRawByte = 0;
            sweepSigned = (int32_t)calSweepRaw;
            calSweepRaw = 0;
            absRaw = absCounts32(sweepSigned);
            cmpRaw = psocCalCompareCounts(sweepSigned);
            errRaw = calTargetValid ? (calTargetSigned - cmpRaw) : 0;
            SLAVE_LOG_PRINTF("[CAL] sweep stage=%u/%s dac=%u raw=%ld raw_mV=%ld abs=%lu cmp=%ld cmp_mV=%ld target=%ld target_mV=%ld err=%ld err_mV=%ld\n",
                             calStage, psocCalStageName(calStage), calDac,
                             (long)sweepSigned, (long)adcCountsToMv(sweepSigned),
                             (unsigned long)absRaw,
                             (long)cmpRaw, (long)adcCountsToMv(cmpRaw),
                             calTargetValid ? (long)calTargetSigned : 0L,
                             calTargetValid ? (long)adcCountsToMv(calTargetSigned) : 0L,
                             (long)errRaw, (long)adcCountsToMv(errRaw));
            LOGM("CAL_SWEEP", "stage=%u,name=%s,dac=%u,measRaw=%ld,raw_mV=%ld,abs=%lu,cmp=%ld,cmp_mV=%ld,target=%ld,target_mV=%ld,err=%ld,err_mV=%ld",
                 calStage, psocCalStageName(calStage), calDac,
                 (long)sweepSigned, (long)adcCountsToMv(sweepSigned),
                 (unsigned long)absRaw, (long)cmpRaw, (long)adcCountsToMv(cmpRaw),
                 calTargetValid ? (long)calTargetSigned : 0L,
                 calTargetValid ? (long)adcCountsToMv(calTargetSigned) : 0L,
                 (long)errRaw, (long)adcCountsToMv(errRaw));
        }
    } else if (event.event == PSOC_EVT_ADC_RAW32) {
        adcSnapshotRaw = (adcSnapshotRaw << 8) | event.value;
        adcSnapshotRawByte++;
        if (adcSnapshotRawByte >= 4) {
            int32_t adcSigned;
            uint32_t absRaw;
            int32_t cmpRaw;
            int32_t errRaw;
            adcSnapshotRawByte = 0;
            adcSigned = (int32_t)adcSnapshotRaw;
            adcSnapshotRaw = 0;
            absRaw = absCounts32(adcSigned);
            cmpRaw = psocCalCompareCounts(adcSigned);
            errRaw = calTargetValid ? (calTargetSigned - cmpRaw) : 0;
            SLAVE_LOG_PRINTF("[ADC] snapshot stage=%u/%s dac=%u raw=%ld raw_mV=%ld abs=%lu cmp=%ld cmp_mV=%ld target=%ld target_mV=%ld err=%ld err_mV=%ld\n",
                             calStage, psocCalStageName(calStage), calDac,
                             (long)adcSigned, (long)adcCountsToMv(adcSigned),
                             (unsigned long)absRaw, (long)cmpRaw,
                             (long)adcCountsToMv(cmpRaw),
                             calTargetValid ? (long)calTargetSigned : 0L,
                             calTargetValid ? (long)adcCountsToMv(calTargetSigned) : 0L,
                             (long)errRaw, (long)adcCountsToMv(errRaw));
            LOGM("ADC_SNAPSHOT", "stage=%u,name=%s,dac=%u,raw=%ld,raw_mV=%ld,abs=%lu,cmp=%ld,cmp_mV=%ld,target=%ld,target_mV=%ld,err=%ld,err_mV=%ld",
                 calStage, psocCalStageName(calStage), calDac,
                 (long)adcSigned, (long)adcCountsToMv(adcSigned),
                 (unsigned long)absRaw, (long)cmpRaw,
                 (long)adcCountsToMv(cmpRaw),
                 calTargetValid ? (long)calTargetSigned : 0L,
                 calTargetValid ? (long)adcCountsToMv(calTargetSigned) : 0L,
                 (long)errRaw, (long)adcCountsToMv(errRaw));
        }
    } else if (event.event == PSOC_EVT_CAL_PI_GAIN32 ||
               event.event == PSOC_EVT_CAL_PI_ERROR32 ||
               event.event == PSOC_EVT_CAL_PI_BUCKET32) {
        if (calPiRawByte == 0 || calPiRawEvent != event.event) {
            calPiRaw = 0;
            calPiRawByte = 0;
            calPiRawEvent = event.event;
        }
        calPiRaw = (calPiRaw << 8) | event.value;
        calPiRawByte++;
        if (calPiRawByte >= 4) {
            int32_t piSigned = (int32_t)calPiRaw;
            const char *kind =
                (event.event == PSOC_EVT_CAL_PI_GAIN32) ? "gain_x1000" :
                (event.event == PSOC_EVT_CAL_PI_ERROR32) ? "error_dac" :
                                                           "bucket";
            calPiRaw = 0;
            calPiRawByte = 0;
            calPiRawEvent = 0;
            SLAVE_LOG_PRINTF("[CAL] pi stage=%u/%s %s=%ld\n",
                             calStage, psocCalStageName(calStage),
                             kind, (long)piSigned);
            LOGM("CAL_PI", "stage=%u,name=%s,%s=%ld",
                 calStage, psocCalStageName(calStage),
                 kind, (long)piSigned);
        }
    } else if (event.event == PSOC_EVT_CAL_PI_DEADBAND) {
        SLAVE_LOG_PRINTF("[CAL] pi stage=%u/%s deadband_dac=%u\n",
                         calStage, psocCalStageName(calStage), event.value);
        LOGM("CAL_PI", "stage=%u,name=%s,deadband_dac=%u",
             calStage, psocCalStageName(calStage), event.value);
    } else if (event.event == PSOC_EVT_CAL_PI_STABLE) {
        SLAVE_LOG_PRINTF("[CAL] pi stage=%u/%s stable=%u\n",
                         calStage, psocCalStageName(calStage), event.value);
        LOGM("CAL_PI", "stage=%u,name=%s,stable=%u",
             calStage, psocCalStageName(calStage), event.value);
    } else if (event.event == PSOC_EVT_CAL_STAGE_MEAS) {
        if (!calMeasHigh) {
            calMeas = (int16_t)((uint16_t)event.value << 8);
            calMeasHigh = true;
        } else {
            calMeas = (int16_t)((uint16_t)calMeas | event.value);
            calMeasHigh = false;
#if PSOC_CAL_LOG_CLAMPED_POINTS
            SLAVE_LOG_PRINTF("[CAL] point16 stage=%u/%s dac=%u meas=%d\n",
                             calStage, psocCalStageName(calStage),
                             calDac, (int)calMeas);
            LOGM("CAL_POINT16", "stage=%u,name=%s,dac=%u,meas=%d",
                 calStage, psocCalStageName(calStage), calDac, (int)calMeas);
#endif
        }
    } else if (event.event == PSOC_EVT_CAL_STAGE_MEAS32) {
        calMeasRaw = (calMeasRaw << 8) | event.value;
        calMeasRawByte++;
        if (calMeasRawByte >= 4) {
            uint32_t absRaw;
            int32_t cmpRaw;
            int32_t errRaw;
            calMeasRawByte = 0;
            calMeasRawSigned = (int32_t)calMeasRaw;
            calMeasRaw = 0;
            absRaw = absCounts32(calMeasRawSigned);
            cmpRaw = psocCalCompareCounts(calMeasRawSigned);
            errRaw = calTargetValid ? (calTargetSigned - cmpRaw) : 0;
#if PSOC_CAL_LOG_POINTS
            SLAVE_LOG_PRINTF("[CAL] point stage=%u/%s i=%u dac=%u raw=%ld raw_mV=%ld abs=%lu cmp=%ld cmp_mV=%ld target=%ld target_mV=%ld err=%ld err_mV=%ld\n",
                             calStage, psocCalStageName(calStage),
                             (unsigned)calPointIndex, calDac,
                             (long)calMeasRawSigned, (long)adcCountsToMv(calMeasRawSigned),
                             (unsigned long)absRaw,
                             (long)cmpRaw, (long)adcCountsToMv(cmpRaw),
                             calTargetValid ? (long)calTargetSigned : 0L,
                             calTargetValid ? (long)adcCountsToMv(calTargetSigned) : 0L,
                             (long)errRaw, (long)adcCountsToMv(errRaw));
            LOGM("CAL_POINT32", "stage=%u,name=%s,i=%u,dac=%u,measRaw=%ld,raw_mV=%ld,abs=%lu,cmp=%ld,cmp_mV=%ld,target=%ld,target_mV=%ld,err=%ld,err_mV=%ld",
                 calStage, psocCalStageName(calStage),
                 (unsigned)calPointIndex, calDac, (long)calMeasRawSigned,
                 (long)adcCountsToMv(calMeasRawSigned),
                 (unsigned long)absRaw, (long)cmpRaw, (long)adcCountsToMv(cmpRaw),
                 calTargetValid ? (long)calTargetSigned : 0L,
                 calTargetValid ? (long)adcCountsToMv(calTargetSigned) : 0L,
                 (long)errRaw, (long)adcCountsToMv(errRaw));
#endif
            calPointIndex++;
        }
    } else if (event.event == PSOC_EVT_CAL_REALCHECK_DAC) {
        calDac = event.value;
        calMeasRaw = 0;
        calMeasRawByte = 0;
    } else if (event.event == PSOC_EVT_CAL_REALCHECK_MEAS32) {
        calMeasRaw = (calMeasRaw << 8) | event.value;
        calMeasRawByte++;
        if (calMeasRawByte >= 4) {
            uint32_t absRaw;
            calMeasRawByte = 0;
            calMeasRawSigned = (int32_t)calMeasRaw;
            absRaw = absCounts32(calMeasRawSigned);
#if PSOC_CAL_LOG_POINTS
            SLAVE_LOG_PRINTF("[CAL] realcheck point stage=%u/%s i=%u dac=%u raw=%ld abs=%lu\n",
                             calStage, psocCalStageName(calStage),
                             (unsigned)calPointIndex, calDac,
                             (long)calMeasRawSigned, (unsigned long)absRaw);
            LOGM("CAL_REALCHECK_POINT32", "stage=%u,name=%s,i=%u,dac=%u,measRaw=%ld,abs=%lu",
                 calStage, psocCalStageName(calStage),
                 (unsigned)calPointIndex, calDac, (long)calMeasRawSigned,
                 (unsigned long)absRaw);
#endif
            calPointIndex++;
        }
    } else if (event.event == PSOC_EVT_CAL_STAGE_OK) {
        uint32_t absRaw = absCounts32(calMeasRawSigned);
        int32_t cmpRaw = psocCalCompareCounts(calMeasRawSigned);
        int32_t errRaw = calTargetValid ? (calTargetSigned - cmpRaw) : 0;
        if (calStage < CMD_CAL_VDAC_STAGE_COUNT) {
            sendCfgAck((uint8_t)(CMD_CAL_VDAC_STAGE_BASE + calStage), calDac);
            sendCfgAckS16(CMD_CAL_TARGET_MV_HI_BASE, CMD_CAL_TARGET_MV_LO_BASE,
                          calStage, calTargetValid ? adcCountsToMv(calTargetSigned) : 0);
            sendCfgAckS16(CMD_CAL_ERROR_MV_HI_BASE, CMD_CAL_ERROR_MV_LO_BASE,
                          calStage, adcCountsToMv(errRaw));
        }
        SLAVE_LOG_PRINTF("[CAL] result stage=%u/%s ok=%u dac=%u raw=%ld raw_mV=%ld abs=%lu cmp=%ld cmp_mV=%ld target=%ld target_mV=%ld err=%ld err_mV=%ld meas16=%d\n",
                         calStage, psocCalStageName(calStage), event.value,
                         calDac, (long)calMeasRawSigned,
                         (long)adcCountsToMv(calMeasRawSigned),
                         (unsigned long)absRaw, (long)cmpRaw,
                         (long)adcCountsToMv(cmpRaw),
                         calTargetValid ? (long)calTargetSigned : 0L,
                         calTargetValid ? (long)adcCountsToMv(calTargetSigned) : 0L,
                         (long)errRaw, (long)adcCountsToMv(errRaw), (int)calMeas);
        LOGM("CAL_STAGE", "stage=%u,name=%s,ok=%u,dac=%u,measRaw=%ld,raw_mV=%ld,abs=%lu,cmp=%ld,cmp_mV=%ld,target=%ld,target_mV=%ld,err=%ld,err_mV=%ld,meas16=%d",
             calStage, psocCalStageName(calStage), event.value,
             calDac, (long)calMeasRawSigned,
             (long)adcCountsToMv(calMeasRawSigned),
             (unsigned long)absRaw,
             (long)cmpRaw, (long)adcCountsToMv(cmpRaw),
             calTargetValid ? (long)calTargetSigned : 0L,
             calTargetValid ? (long)adcCountsToMv(calTargetSigned) : 0L,
             (long)errRaw, (long)adcCountsToMv(errRaw),
             (int)calMeas);
    } else if (event.event == PSOC_EVT_SERVO_STEP) {
        SLAVE_LOG_PRINTF("[CAL] servo step stage=%u/%s dac=%u\n",
                         calStage, psocCalStageName(calStage), event.value);
        LOGM("SERVO_STEP", "stage=%u,name=%s,dac=%u",
             calStage, psocCalStageName(calStage), event.value);
    } else if (event.event == PSOC_EVT_CAL_LOOP) {
        SLAVE_LOG_PRINTF("[CAL] loop stage=%u/%s dac=%u -> best candidate\n",
                         calStage, psocCalStageName(calStage), event.value);
        LOGM("CAL_LOOP", "stage=%u,name=%s,dac=%u",
             calStage, psocCalStageName(calStage), event.value);
    } else if (event.event == PSOC_EVT_CAL_STAGE_SAT) {
        if (event.value) {
            SLAVE_LOG_PRINTF("[CAL] saturation stage=%u/%s dac=%u\n",
                             calStage, psocCalStageName(calStage), calDac);
            LOGM("CAL_SAT", "stage=%u,name=%s,dac=%u",
                 calStage, psocCalStageName(calStage), calDac);
        }
    } else if (event.event == PSOC_EVT_CAL_STAGE_SAT_ALL) {
        SLAVE_LOG_PRINTF("[CAL] all candidates saturated stage=%u/%s\n",
                         event.value, psocCalStageName(event.value));
        LOGM("CAL_SAT_ALL", "stage=%u,name=%s", event.value,
             psocCalStageName(event.value));
    } else if (event.event == PSOC_EVT_CAL_REALCHECK_NUDGE) {
        int8_t nudge = (int8_t)event.value;
        SLAVE_LOG_PRINTF("[CAL] realcheck nudge stage=%u/%s dac=%u step=%d\n",
