simplementeUnPorito/Tesis-firmware-esp32/Nodo comunicación/slave/src/main.cpp
                         calStage, psocCalStageName(calStage), calDac,
                         (int)nudge);
        LOGM("CAL_REALCHECK_NUDGE", "stage=%u,name=%s,dac=%u,step=%d",
             calStage, psocCalStageName(calStage), calDac, (int)nudge);
    } else if (event.event == PSOC_EVT_CAL_REALCHECK_OK) {
        uint32_t absRaw = absCounts32(calMeasRawSigned);
        SLAVE_LOG_PRINTF("[CAL] realcheck result stage=%u/%s ok=%u dac=%u raw=%ld abs=%lu\n",
                         calStage, psocCalStageName(calStage), event.value,
                         calDac, (long)calMeasRawSigned,
                         (unsigned long)absRaw);
        LOGM("CAL_REALCHECK", "stage=%u,name=%s,ok=%u,dac=%u,measRaw=%ld,abs=%lu",
             calStage, psocCalStageName(calStage), event.value,
             calDac, (long)calMeasRawSigned, (unsigned long)absRaw);
    } else if (event.event == PSOC_EVT_CAL_VERIFY_OK) {
        uint32_t absRaw = absCounts32(calMeasRawSigned);
        SLAVE_LOG_PRINTF("[CAL] verify stage=%u/%s ok=%u dac=%u raw=%ld abs=%lu meas16=%d\n",
                         calStage, psocCalStageName(calStage), event.value,
                         calDac, (long)calMeasRawSigned,
                         (unsigned long)absRaw, (int)calMeas);
        LOGM("CAL_VERIFY", "stage=%u,name=%s,ok=%u,dac=%u,measRaw=%ld,abs=%lu,meas16=%d",
             calStage, psocCalStageName(calStage), event.value,
             calDac, (long)calMeasRawSigned, (unsigned long)absRaw,
             (int)calMeas);
    } else if (event.event == PSOC_EVT_CAL_AMUX_IN) {
        SLAVE_LOG_PRINTF("[CAL] AMux signal channel=%u\n", event.value);
        LOGM("CAL_AMUX_IN", "channel=%u", event.value);
    } else if (event.event == PSOC_EVT_CAL_AMUX_CAP) {
        SLAVE_LOG_PRINTF("[CAL] AMux cap channel=%u\n", event.value);
        LOGM("CAL_AMUX_CAP", "channel=%u", event.value);
    } else if (event.event == PSOC_EVT_CAL_PROGRESS) {
        if (!(g_cfg_waiting && g_cfg_sub_cmd == PSOC_CMD_CALIBRATE)) {
            uint32_t now = millis();
            if ((uint32_t)(now - g_cal_progress_ack_ms) >=
                PSOC_CAL_PROGRESS_ACK_PERIOD_MS) {
                g_cal_progress_ack_ms = now;
                sendCfgAck(PSOC_CMD_CALIBRATE, 2);
            }
        }
#if PSOC_CAL_LOG_PROGRESS
        SLAVE_LOG_PRINTF("[CAL] progress stage=%u/%s\n",
                         event.value, psocCalStageName(event.value));
        LOGM("CAL_PROGRESS", "stage=%u,name=%s", event.value,
             psocCalStageName(event.value));
#endif
        /* Para calibracion manual, servicePsocConfigAck() emite el heartbeat
         * mientras g_cfg_waiting este activo. Para boot-cal autonoma no hay
         * pending ACK, asi que este evento mantiene vivo el estado del maestro. */
    } else if (event.event == PSOC_EVT_CAL_WATCHDOG) {
        SLAVE_LOG_PRINTF("[CAL] WATCHDOG timeout stage=%u/%s -> aborted\n",
                         event.value, psocCalStageName(event.value));
        LOGM("CAL_WATCHDOG", "stage=%u,name=%s", event.value,
             psocCalStageName(event.value));
    } else if (event.event == PSOC_EVT_CAL_LP_BAD) {
        SLAVE_LOG_PRINTF("[CAL] CRITICAL stage=%u/%s LP out of range\n",
                         event.value, psocCalStageName(event.value));
        LOGM("CAL_LP_BAD", "stage=%u,name=%s", event.value,
             psocCalStageName(event.value));
    } else if (event.event == PSOC_EVT_BUTTON) {
        SLAVE_LOG_PRINTF("[BUTTON] pressed pstate=%u/%s\n",
                         event.value, psocStateName(event.value));
        LOGM("BUTTON", "pstate=%u,pstateName=%s",
             event.value, psocStateName(event.value));
    } else if (event.event == PSOC_EVT_BUTTON_IGNORED) {
        SLAVE_LOG_PRINTF("[BUTTON] ignored pstate=%u/%s\n",
                         event.value, psocStateName(event.value));
        LOGM("BUTTON_IGNORED", "pstate=%u,pstateName=%s",
             event.value, psocStateName(event.value));
    } else if (event.event == PSOC_EVT_CAPTURE_CLAMPED) {
        SLAVE_LOG_PRINTF("[CAPTURE] clamped requested_sat=%u max=%u\n",
                         event.value, PSOC_CAPTURE_MAX_BATCHES);
        LOGM("CAPTURE_CLAMPED", "requested_sat=%u,max=%u",
             event.value, PSOC_CAPTURE_MAX_BATCHES);
    }

#if PSOC_DIAG_VERBOSE
    const char *eventName = psocDiagName(event.event);
    const char *stateName = psocStateName(event.psoc_state);
    SLAVE_LOG_PRINTF("[SLAVE] PSOC_EVT %s event=0x%02X val=%u pstate=%u/%s estate=%d bytes=%lu bOK=%lu fill=%u/%u\n",
                     eventName, event.event, event.value,
                     event.psoc_state, stateName, (int)g_state,
                     (unsigned long)psoc.bytesRx(),
                     (unsigned long)psoc.batchesOK(),
                     (unsigned)g_store_fill, (unsigned)g_rec_n_batches);
    LOGM("PSOC_EVT", "event=0x%02X,name=%s,val=%u,pstate=%u,pstateName=%s,estate=%d,bytes=%lu,bOK=%lu,fill=%u/%u",
         event.event, eventName, event.value,
         event.psoc_state, stateName, (int)g_state,
         (unsigned long)psoc.bytesRx(),
         (unsigned long)psoc.batchesOK(),
         (unsigned)g_store_fill, (unsigned)g_rec_n_batches);
#endif
}

/* ── ISR GPIO hardware sync (IRAM para máxima velocidad) ────────────────── */
void IRAM_ATTR onSyncEdge()
{
    int level = digitalRead(SYNC_IN_PIN);
    if (level == HIGH && g_state == HOT_WAIT) {
        digitalWrite(SYNC_TO_PSOC_PIN, HIGH);
        uint32_t nowUs = (uint32_t)micros();
        g_t_start_us    = (uint64_t)nowUs;
        g_store_fill    = 0;
        g_debug_count   = 0;
        g_debug_last_us = nowUs;
        g_state = SAMPLING;
    } else if (level == LOW && g_state == SAMPLING) {
        digitalWrite(SYNC_TO_PSOC_PIN, LOW);
        g_state = STOPPED;
    } else if (g_state != SAMPLING) {
        digitalWrite(SYNC_TO_PSOC_PIN, LOW);
    }
}

/* ── Forward declarations ────────────────────────────────────────────────── */
static void allocStore(uint16_t n_batches);
static void handleReqBatch(const MsgReqBatch *msg);

/* ── Callbacks ESP-NOW ───────────────────────────────────────────────────── */

static void sendCfgAck(uint8_t sub_cmd, uint8_t ok)
{
    MsgCfgAck ack = { CMD_CFG_ACK, NODE_ID, sub_cmd, ok };
    sendToMaster((const uint8_t *)&ack, sizeof(ack));
}

static void clearCompletionAckRetry()
{
    g_completion_ack_sub_cmd = 0;
    g_completion_ack_ok = 0;
    g_completion_ack_retries_left = 0;
    g_completion_ack_next_ms = 0;
}

static void sendCompletionAckWithRetry(uint8_t sub_cmd)
{
    sendCfgAck(sub_cmd, 2);
    g_completion_ack_sub_cmd = sub_cmd;
    g_completion_ack_ok = 2;
    g_completion_ack_retries_left = COMPLETION_ACK_RETRY_COUNT;
    g_completion_ack_next_ms = millis() + COMPLETION_ACK_RETRY_PERIOD_MS;
}

static void serviceCompletionAckRetry()
{
    if (g_completion_ack_sub_cmd == 0 || g_completion_ack_retries_left == 0) {
        return;
    }
    if ((int32_t)(millis() - g_completion_ack_next_ms) < 0) {
        return;
    }
    sendCfgAck(g_completion_ack_sub_cmd, g_completion_ack_ok);
    g_completion_ack_retries_left--;
    g_completion_ack_next_ms = millis() + COMPLETION_ACK_RETRY_PERIOD_MS;
}

static bool isGainCode(uint8_t code)
{
    return code <= 8u;
}

static bool isAdcConfigCode(uint8_t code)
{
    return code >= 1u && code <= 4u;
}

static bool isDecimationFactor(uint8_t factor)
{
    return factor >= 1u && factor <= 100u;
}

static void applyConfirmedConfig(uint8_t sub_cmd, uint8_t value)
{
    switch (sub_cmd) {
        case 0xA6:
            g_pga_code = value;
            break;
        case 0xA9:
            g_pgavdac = value;
            break;
        case 0xAA:
            g_vdac_byte = value;
            break;
        default:
            break;
    }
}

static uint8_t expectedPsocAckValue(uint8_t sub_cmd, uint8_t param)
{
    /* SAVE_EEPROM se envia con parametro 0, pero el PSoC responde 1 si grabo bien. */
    return (sub_cmd == PSOC_CMD_SAVE_EEPROM) ? 1u : param;
}

