simplementeUnPorito/Tesis-firmware-esp32/Nodo comunicación/slave/src/main.cpp
static void waitForPsocConfigAck(uint8_t sub_cmd, uint8_t param)
{
    g_cfg_sub_cmd = sub_cmd;
    g_cfg_param = param;
    g_cfg_start_ms = millis();
    g_cfg_timeout_ms = (sub_cmd == PSOC_CMD_CALIBRATE)
                     ? PSOC_CAL_ACK_TIMEOUT_MS
                     : ((sub_cmd == PSOC_CMD_ADC_SNAPSHOT)
                        ? PSOC_ADC_SNAPSHOT_ACK_TIMEOUT_MS
                        : PSOC_CFG_ACK_TIMEOUT_MS);
    g_cfg_waiting = true;
    if (sub_cmd == PSOC_CMD_CALIBRATE) {
        /* Que el primer "calibrando..." salga ya en el proximo loop(),
         * sin esperar PSOC_CAL_PROGRESS_ACK_PERIOD_MS. */
        g_cal_progress_ack_ms = g_cfg_start_ms - PSOC_CAL_PROGRESS_ACK_PERIOD_MS;
    }
}

static bool ensurePsocReadyForConfig()
{
    psoc.poll();
    if (g_psocConnected && psoc.hasLastByte() &&
        psoc.lastByteAgeMs() <= PSOC_CFG_READY_STALE_MS) {
        return true;
    }

    const bool ready = psoc.probe(250);
    g_psocConnected = ready;
    if (!ready) {
        SLAVE_LOG_PRINTF("[SLAVE] PSoC cfg probe failed age=%lu bytes=%lu\n",
                         (unsigned long)psoc.lastByteAgeMs(),
                         (unsigned long)psoc.bytesRx());
        LOGM("CFG_PSOC_MISS", "age=%lu,bytes=%lu",
             (unsigned long)psoc.lastByteAgeMs(),
             (unsigned long)psoc.bytesRx());
    }
    return ready;
}

static void servicePsocConfigAck()
{
    if (g_state == SAMPLING) {
        return;   /* Nunca emitir ACK/timeout por radio durante la captura. */
    }

    uint8_t ackCmd = 0;
    uint8_t ackVal = 0;
    while (psoc.takeConfigAck(ackCmd, ackVal)) {
        g_psocConnected = true;
        if (g_cfg_waiting && ackCmd == g_cfg_sub_cmd) {
            const uint8_t expected = expectedPsocAckValue(g_cfg_sub_cmd, g_cfg_param);
            const uint8_t ok = (ackVal == expected) ? 1u : 0u;
            if (ok) {
                applyConfirmedConfig(ackCmd, ackVal);
            }
            sendCfgAck(g_cfg_sub_cmd, ok);
            SLAVE_LOG_PRINTF("[SLAVE] PSoC cfg ack sub=0x%02X val=%u expected=%u ok=%u\n",
                             ackCmd, ackVal, expected, ok);
            LOGM("CFG_ACK", "sub=0x%02X,val=%u,expected=%u,ok=%u",
                 ackCmd, ackVal, expected, ok);
            g_cfg_waiting = false;
        } else {
            applyConfirmedConfig(ackCmd, ackVal);
            SLAVE_LOG_PRINTF("[SLAVE] PSoC cfg ack unsolicited sub=0x%02X val=%u\n",
                             ackCmd, ackVal);
            LOGM("CFG_ACK_UNSOL", "sub=0x%02X,val=%u", ackCmd, ackVal);
        }
    }

    if (g_cfg_waiting &&
        (uint32_t)(millis() - g_cfg_start_ms) >= g_cfg_timeout_ms) {
        const uint8_t expected = expectedPsocAckValue(g_cfg_sub_cmd, g_cfg_param);
        sendCfgAck(g_cfg_sub_cmd, 0);
        SLAVE_LOG_PRINTF("[SLAVE] PSoC cfg ack timeout sub=0x%02X expected=%u elapsed=%lu/%lu\n",
                         g_cfg_sub_cmd, expected,
                         (unsigned long)(millis() - g_cfg_start_ms),
                         (unsigned long)g_cfg_timeout_ms);
        LOGM("CFG_TIMEOUT", "sub=0x%02X,expected=%u,elapsed=%lu,timeout=%lu",
             g_cfg_sub_cmd, expected,
             (unsigned long)(millis() - g_cfg_start_ms),
             (unsigned long)g_cfg_timeout_ms);
        g_cfg_waiting = false;
    }

    /* "Calibrando..." (ok=2) hacia el maestro: por temporizador propio del
     * ESP, independiente de que el stream de diagnostico del PSoC llegue.
     * Mientras g_cfg_waiting este activo para CALIBRATE (hasta
     * PSOC_CAL_ACK_TIMEOUT_MS=450s o el ack final), repetir cada
     * PSOC_CAL_PROGRESS_ACK_PERIOD_MS para que el panel muestre el estado
     * "Calibrando..." de forma confiable. */
    if (g_cfg_waiting && g_cfg_sub_cmd == PSOC_CMD_CALIBRATE) {
        uint32_t now = millis();
        if ((uint32_t)(now - g_cal_progress_ack_ms) >= PSOC_CAL_PROGRESS_ACK_PERIOD_MS) {
            g_cal_progress_ack_ms = now;
            sendCfgAck(PSOC_CMD_CALIBRATE, 2);
        }
    }
}

static bool sendAndConfirmPsocSetN(uint16_t n_batches)
{
    const uint8_t expected = (n_batches > 255u) ? 255u : (uint8_t)n_batches;
    const uint32_t startMs = millis();
    const uint32_t startSeq = g_psoc_setn_seq;

    psoc.setN(n_batches);
    while ((uint32_t)(millis() - startMs) < PSOC_SETN_ACK_TIMEOUT_MS) {
        psoc.poll();
        servicePsocConfigAck();
        if (g_psoc_setn_seq != startSeq &&
            g_psoc_last_setn_value == expected &&
            (int32_t)(g_psoc_last_setn_ms - startMs) >= 0) {
            return true;
        }
        delay(1);
    }

    SLAVE_LOG_PRINTF("[SLAVE] PSoC SETN ack timeout n=%u expected=%u last=%u age=%lu\n",
                     (unsigned)n_batches, (unsigned)expected,
                     (unsigned)g_psoc_last_setn_value,
                     (unsigned long)(millis() - g_psoc_last_setn_ms));
    LOGM("SETN_TIMEOUT", "n=%u,expected=%u,last=%u,age=%lu",
         (unsigned)n_batches, (unsigned)expected,
         (unsigned)g_psoc_last_setn_value,
         (unsigned long)(millis() - g_psoc_last_setn_ms));
    return false;
}

static bool captureOrDumpBusy()
{
    return (g_state == SAMPLING || g_state == HOT_WAIT ||
            g_view_remaining != 0 ||
            (g_state == STOPPED && g_rec_n_batches > 0));
}

static bool requestPsocCalibration(const char *source)
{
    if (captureOrDumpBusy()) {
        SLAVE_LOG_PRINTF("[%s] cal ignored: capture/dump busy state=%d\n",
                         source, (int)g_state);
        LOGM("CAL_REQ", "source=%s,ok=0,reason=capture_busy,state=%d",
             source, (int)g_state);
        return false;
    }

    servicePsocConfigAck();
    if (g_cfg_waiting) {
        SLAVE_LOG_PRINTF("[%s] cal ignored: pending sub=0x%02X\n",
                         source, g_cfg_sub_cmd);
        LOGM("CAL_REQ", "source=%s,ok=0,reason=cfg_busy,pending=0x%02X",
             source, g_cfg_sub_cmd);
        return false;
    }

    if (!ensurePsocReadyForConfig()) {
        SLAVE_LOG_PRINTF("[%s] cal failed: PSoC not ready\n", source);
        LOGM("CAL_REQ", "source=%s,ok=0,reason=psoc_not_ready", source);
        return false;
    }

    psoc.calibrate();
    waitForPsocConfigAck(PSOC_CMD_CALIBRATE, 1);
    SLAVE_LOG_PRINTF("[%s] cal -> PSoC CMD 0x%02X\n", source, PSOC_CMD_CALIBRATE);
    LOGM("CAL_REQ", "source=%s,ok=1,sub=0x%02X", source, PSOC_CMD_CALIBRATE);
    return true;
}

static bool requestPsocAdcSnapshot(const char *source)
{
    if (captureOrDumpBusy()) {
        SLAVE_LOG_PRINTF("[%s] adc ignored: capture/dump busy state=%d\n",
                         source, (int)g_state);
        LOGM("ADC_REQ", "source=%s,ok=0,reason=capture_busy,state=%d",
             source, (int)g_state);
        return false;
    }

    servicePsocConfigAck();
    if (g_cfg_waiting) {
        SLAVE_LOG_PRINTF("[%s] adc ignored: pending sub=0x%02X\n",
                         source, g_cfg_sub_cmd);
        LOGM("ADC_REQ", "source=%s,ok=0,reason=cfg_busy,pending=0x%02X",
             source, g_cfg_sub_cmd);
        return false;
    }

