simplementeUnPorito/Tesis-firmware-esp32/Nodo comunicación/slave/src/main.cpp
    if (!ensurePsocReadyForConfig()) {
        SLAVE_LOG_PRINTF("[%s] adc failed: PSoC not ready\n", source);
        LOGM("ADC_REQ", "source=%s,ok=0,reason=psoc_not_ready", source);
        return false;
    }

    psoc.adcSnapshot();
    waitForPsocConfigAck(PSOC_CMD_ADC_SNAPSHOT, 1);
    SLAVE_LOG_PRINTF("[%s] adc -> PSoC CMD 0x%02X\n", source, PSOC_CMD_ADC_SNAPSHOT);
    LOGM("ADC_REQ", "source=%s,ok=1,sub=0x%02X", source, PSOC_CMD_ADC_SNAPSHOT);
    return true;
}

#if PSOC_AUTO_CAL_ON_READY
static void scheduleAutoCalibration(uint32_t delayMs)
{
    if (!g_auto_cal_requested) {
        g_auto_cal_due_ms = millis() + delayMs;
        SLAVE_LOG_PRINTF("[AUTO_CAL] scheduled in %lu ms (due=%lu)\n",
                         (unsigned long)delayMs, (unsigned long)g_auto_cal_due_ms);
        LOGM("AUTO_CAL", "ev=scheduled,delay_ms=%lu", (unsigned long)delayMs);
    }
}

static void serviceAutoCalibration()
{
    if (g_auto_cal_requested || g_auto_cal_due_ms == 0u) {
        return;
    }
    if ((int32_t)(millis() - g_auto_cal_due_ms) < 0) {
        return;
    }
    if (!g_psocConnected || captureOrDumpBusy() || g_cfg_waiting) {
        SLAVE_LOG_PRINTF("[AUTO_CAL] deferred (psocConnected=%d busy=%d cfg_waiting=%d) retry in %lu ms\n",
                         (int)g_psocConnected, (int)captureOrDumpBusy(), (int)g_cfg_waiting,
                         (unsigned long)PSOC_AUTO_CAL_RETRY_MS);
        LOGM("AUTO_CAL", "ev=deferred,psoc=%d,busy=%d,cfg_waiting=%d",
             (int)g_psocConnected, (int)captureOrDumpBusy(), (int)g_cfg_waiting);
        g_auto_cal_due_ms = millis() + PSOC_AUTO_CAL_RETRY_MS;
        return;
    }
    SLAVE_LOG_PRINTF("[AUTO_CAL] due -> requesting calibration\n");
    if (requestPsocCalibration("AUTO")) {
        g_auto_cal_requested = true;
        g_auto_cal_due_ms = 0u;
        LOGM("AUTO_CAL", "ev=requested,ok=1");
    } else {
        SLAVE_LOG_PRINTF("[AUTO_CAL] request failed, retry in %lu ms\n",
                         (unsigned long)PSOC_AUTO_CAL_RETRY_MS);
        LOGM("AUTO_CAL", "ev=requested,ok=0");
        g_auto_cal_due_ms = millis() + PSOC_AUTO_CAL_RETRY_MS;
    }
}
#else
static void scheduleAutoCalibration(uint32_t) {}
static void serviceAutoCalibration() {}
#endif

#if SLAVE_USB_CMD_ENABLE
static bool usbCommandEquals(const char *cmd, const char *word)
{
    while (*cmd != '\0' && *word != '\0') {
        char a = *cmd++;
        char b = *word++;
        if (a >= 'A' && a <= 'Z') { a = (char)(a - 'A' + 'a'); }
        if (b >= 'A' && b <= 'Z') { b = (char)(b - 'A' + 'a'); }
        if (a != b) { return false; }
    }
    return *cmd == '\0' && *word == '\0';
}

static bool usbCommandStartsWithWord(const char *cmd, const char *word)
{
    while (*cmd != '\0' && *word != '\0') {
        char a = *cmd++;
        char b = *word++;
        if (a >= 'A' && a <= 'Z') { a = (char)(a - 'A' + 'a'); }
        if (b >= 'A' && b <= 'Z') { b = (char)(b - 'A' + 'a'); }
        if (a != b) { return false; }
    }
    return *word == '\0' && (*cmd == ' ' || *cmd == '=' || *cmd == ':');
}

static bool usbParseGainParam(const char *cmd, const char *word, uint8_t &value)
{
    if (!usbCommandStartsWithWord(cmd, word)) {
        return false;
    }
    while (*cmd != '\0' && *cmd != ' ' && *cmd != '=' && *cmd != ':') {
        cmd++;
    }
    while (*cmd == ' ' || *cmd == '=' || *cmd == ':') {
        cmd++;
    }
    if (*cmd < '0' || *cmd > '8') {
        return false;
    }
    value = (uint8_t)(*cmd - '0');
    cmd++;
    while (*cmd == ' ') {
        cmd++;
    }
    return *cmd == '\0';
}

static bool usbParseU16Param(const char *cmd, const char *word, uint16_t &value)
{
    uint32_t acc = 0;
    if (!usbCommandStartsWithWord(cmd, word)) {
        return false;
    }
    while (*cmd != '\0' && *cmd != ' ' && *cmd != '=' && *cmd != ':') {
        cmd++;
    }
    while (*cmd == ' ' || *cmd == '=' || *cmd == ':') {
        cmd++;
    }
    if (*cmd < '0' || *cmd > '9') {
        return false;
    }
    while (*cmd >= '0' && *cmd <= '9') {
        acc = (acc * 10u) + (uint32_t)(*cmd - '0');
        if (acc > 65535u) {
            return false;
        }
        cmd++;
    }
    while (*cmd == ' ') {
        cmd++;
    }
    if (*cmd != '\0') {
        return false;
    }
    value = (uint16_t)acc;
    return true;
}

#if SLAVE_LAB_TOOLS_ENABLE
static void requestPrestartFromUsb(uint16_t n);
static void requestStartNowFromUsb(uint16_t n);
static void requestCaptureFromUsb(uint16_t n);

static bool usbParseTwoU16Params(const char *cmd, const char *word,
                                 uint16_t &first, uint16_t &second)
{
    uint32_t values[2] = {0u, 0u};
    uint8_t index = 0u;

    if (!usbCommandStartsWithWord(cmd, word)) {
        return false;
    }
    while (*cmd != '\0' && *cmd != ' ' && *cmd != '=' && *cmd != ':') {
        cmd++;
    }
    while (*cmd != '\0' && index < 2u) {
        while (*cmd == ' ' || *cmd == '=' || *cmd == ':') {
            cmd++;
        }
        if (*cmd < '0' || *cmd > '9') {
            return false;
        }
        uint32_t acc = 0u;
        while (*cmd >= '0' && *cmd <= '9') {
            acc = (acc * 10u) + (uint32_t)(*cmd - '0');
            if (acc > 65535u) {
                return false;
            }
            cmd++;
        }
        values[index++] = acc;
        while (*cmd == ' ') {
            cmd++;
        }
    }
    if (index != 2u || *cmd != '\0') {
        return false;
    }
    first = (uint16_t)values[0];
    second = (uint16_t)values[1];
    return true;
}

static uint32_t usbCaptureTimeoutMs(uint16_t n)
{
    uint32_t timeoutMs = expectedCaptureMs(n) + 2000u;
    return (timeoutMs < 3000u) ? 3000u : timeoutMs;
}

static void serviceLabWaitSlice()
{
    psoc.poll();
    servicePsocConfigAck();
    delay(1);
}

static void waitForLabCaptureDone(const char *tag, uint16_t requestedBatches)
{
    const uint32_t timeoutMs = usbCaptureTimeoutMs(requestedBatches);
    const uint32_t startMs = millis();
    const uint32_t startOk = psoc.batchesOK();
    const uint32_t startBad = psoc.batchesBad();
    const uint32_t startBytes = psoc.bytesRx();

    while (g_state == SAMPLING &&
           (uint32_t)(millis() - startMs) < timeoutMs) {
        serviceLabWaitSlice();
    }

    const uint32_t elapsedMs = millis() - startMs;
    const bool full = (g_rec_n_batches > 0u &&
                       g_store_fill >= g_rec_n_batches &&
                       g_state == STOPPED);
    const bool timeout = (g_state == SAMPLING);
    SLAVE_LOG_PRINTF("[LAB] %s done=%u timeout=%u ms=%lu/%lu state=%d fill=%u/%u dOK=%lu dBad=%lu dBytes=%lu sync=%d\n",
                     tag, (unsigned)full, (unsigned)timeout,
                     (unsigned long)elapsedMs, (unsigned long)timeoutMs,
                     (int)g_state, (unsigned)g_store_fill,
                     (unsigned)g_rec_n_batches,
                     (unsigned long)(psoc.batchesOK() - startOk),
                     (unsigned long)(psoc.batchesBad() - startBad),
                     (unsigned long)(psoc.bytesRx() - startBytes),
                     digitalRead(SYNC_TO_PSOC_PIN));
    logPsocUartDiag(tag);
}

static void requestLabDiagFromUsb()
{
    SLAVE_LOG_PRINTF("[LAB] diag state=%d psoc=%u streamPga=%u pgavdac=%u vdac=%u syncOut=%d syncIn=%d\n",
                     (int)g_state, (unsigned)g_psocConnected,
                     (unsigned)g_pga_code, (unsigned)g_pgavdac,
                     (unsigned)g_vdac_byte, digitalRead(SYNC_TO_PSOC_PIN),
                     digitalRead(SYNC_IN_PIN));
    logPsocUartDiag("LAB_DIAG");
}

static void requestLabPinsFromUsb()
{
    uint32_t rxEdges;
    uint8_t rxEdgeLevel;
    noInterrupts();
    rxEdges = g_psoc_rx_edges;
    rxEdgeLevel = g_psoc_rx_last_level;
    interrupts();
    SLAVE_LOG_PRINTF("[LAB] pins syncOut=%d syncIn=%d psocRx=%d rxEdges=%lu rxEdgeLevel=%u\n",
                     digitalRead(SYNC_TO_PSOC_PIN), digitalRead(SYNC_IN_PIN),
                     digitalRead(PSOC_UART_RX), (unsigned long)rxEdges,
                     (unsigned)rxEdgeLevel);
}

static void requestQuietWindowFromUsb(uint16_t n, uint16_t ms)
{
    const uint32_t preBytes = psoc.bytesRx();
    const uint32_t prePing = psoc.pingsRx();
    const uint32_t preDiag = psoc.diagEventsRx();
    const uint32_t preOk = psoc.batchesOK();
    const uint32_t preBad = psoc.batchesBad();

    requestPrestartFromUsb(n);

