simplementeUnPorito/Tesis-firmware-esp32/Nodo comunicación/slave/src/main.cpp
    /* Consulta de SD del PSoC mientras no se conozca (0xBC, p=0: estado
     * cacheado, no re-inicializa). Firmware PSoC viejo la ignora en silencio;
     * tras algunos intentos se asume sin SD (sd_present=0, que ya es el
     * default). */
    static uint32_t lastSdQueryMs = 0;
    static uint8_t sdQueryTries = 0;
    if (g_psocConnected && !g_psoc_sd_known && sdQueryTries < 5 &&
        g_state != SAMPLING && g_state != HOT_WAIT && g_view_remaining == 0 &&
        (millis() - lastSdQueryMs) >= 3000) {
        lastSdQueryMs = millis();
        sdQueryTries++;
        psoc.sdStatus(0);
    }

    /* HELLO/Fs cada 2 s mientras no haya captura ni dump pendiente.
     * Si el maestro se reinicia con los esclavos ya ARMED, necesita recuperar
     * este dato sin obligar al operador a cargar Fs manualmente en la web. */
    static uint32_t lastHelloMs = 0;
    if (g_view_remaining == 0 &&
        g_state != SAMPLING &&
        g_state != HOT_WAIT &&
        !(g_state == STOPPED && g_rec_n_batches > 0) &&
        millis() - lastHelloMs >= 2000) {
        lastHelloMs = millis();
        MsgHello h = {
            CMD_HELLO, NODE_ID, (uint8_t)g_psocConnected,
            effectivePsocSampleRateHz(), g_psoc_hw_class,
            psocSdPresent()   /* SD del PSoC, no del ESP32 (sd_storage obsoleto) */
        };
        esp_err_t err = sendToMaster((const uint8_t *)&h, sizeof(h));
#if SLAVE_LOG_HELLO_TX
        SLAVE_LOG_PRINTF("[SLAVE] HELLO tx err=%d txOK=%u txFail=%u\n",
                         (int)err, transport.sentOK(), transport.sentFail());
#else
        (void)err;
#endif
    }

    /* Informe de estado cada 10 s */
    static uint32_t last_status = 0;
    if (g_state != HOT_WAIT && g_state != SAMPLING &&
        millis() - last_status > 10000) {
        last_status = millis();
        MsgStatus st = {
            CMD_STATUS, NODE_ID,
            psoc.batchesOK(), psoc.batchesBad(),
            transport.sentOK(), transport.sentFail(),
            (uint8_t)g_psocConnected
        };
        sendToMaster((const uint8_t *)&st, sizeof(st));
#if SLAVE_LOG_STATUS_PERIODIC
        logPsocUartDiag("STATUS");
#if PSOC_RX_SCAN_ENABLE
        logPsocRxScan();
#endif
#endif
    }
}
